---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalSystemType
source: html/2a746a28-9a28-5e1e-0a9d-b05d6b72376b.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystemType

Base class for duct system types

## Syntax (C#)
```csharp
public class MechanicalSystemType : MEPSystemType
```